# FPenPat

## Description
_Use  FPenPatN  instead._
Function FPenPat returns the active pen pattern setting.

```pascal
FUNCTION FPenPat : INTEGER;
```

```python
def vs.FPenPat():
    return INTEGER
```

## Examples
#### VectorScript ####
```pascal
CurrPenStyle:=FPenPat;
```
#### Python ####
```python
CurrPenStyle = vs.FPenPat()
```

```pascal
resultN := FPenPat;
```
```python
import vs

# _ Function FPenPat returns the active pen pattern setting.
resultN = vs.FPenPat()
vs.Message('FPenPat returned: ' + str(resultN))
```

## See Also
FPenPatN, PenPatN  from Vectorworks 2013

## Version
Availability: from All Versions, deprecated from Vectorworks 2013

## Category
* Document Attributes